# SystemsAnalysisReport Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceTypes..::..BuiltInExternalResourceTypes..::..SystemsAnalysisReport Property
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class See Also
---
An external resource type representing systems analysis report path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalResourceType SystemsAnalysisReport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SystemsAnalysisReport As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
static property ExternalResourceType^ SystemsAnalysisReport {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace